namespace VacanciesParser;

public class ProfessionalCategory
{
  private Dictionary<string, List<string>> professionalCategories = new Dictionary<string, List<string>>()
  {
    
    ["Руководители"] = new List<string>
    {
        "руководитель","начальник","заведующий","директор","генеральный директор",
        "исполнительный директор","заместитель","зам директора","глава","старший",
        "главный","бригадир","руководитель группы","тимлид","менеджер",
        "старший менеджер","ведущий менеджер","управляющий",
        "начальник отдела","начальник управления","начальник участка",
        "начальник производства","заведующий складом",
        "руководитель направления","руководитель проекта",
        "главный инженер","главный бухгалтер"
    },

    ["Специалисты высшего уровня"] = new List<string>
    {
        "врач","врач-невролог","врач-онколог","врач-педиатр",
        "врач-педиатр участковый","врач-терапевт","врач-терапевт участковый",
        "врач-стоматолог","врач-стоматолог-терапевт",
        "ветеринар","инженер","инженер-технолог","инженер-проектировщик",
        "инженер-конструктор","программист","разработчик",
        "системный администратор","администратор баз данных","devops",
        "юрисконсульт","юрист",
        "специалист","ведущий специалист","главный специалист",
        "специалист-эксперт","ведущий специалист-эксперт",
        "инспектор","государственный инспектор","главный государственный инспектор",
        "инспектор труда",
        "лесничий","муниципальный служащий",
        "фармацевт","провизор","фармацевт-провизор",
        "оценщик","энергетик","электроник",
        "бухгалтер","бухгалтер по заработной плате","бухгалтер по заготовкам",
        "экономист","ведущий экономист","экономист по труду",
        "эколог","психолог","тьютор","учитель","преподаватель",
        "эксперт","аналитик","бизнес-аналитик","системный аналитик",
        "методист",
        "специалист по кадрам","специалист по персоналу",
        "специалист по охране труда",
        "специалист по развитию","специалист по развитию производственной системы",
        "специалист по административно-хозяйственному обеспечению",
        "специалист поддержки","специалист поддержки 1с",
        "специалист финансового управления",
        "клиентский менеджер","старший клиентский менеджер"
    },

    ["Специалисты среднего уровня"] = new List<string>
    {
        "администратор","продавец","продавец-кассир","продавец магазина",
        "продавец магнит","продавец в зону готовой еды",
        "консультант","менеджер по работе с клиентами",
        "старший менеджер по работе с клиентами",
        "педагог","воспитатель","помощник воспитателя","младший воспитатель",
        "инструктор","инструктор по труду","тренер",
        "массажист","культорганизатор",
        "медицинская сестра","медицинский брат",
        "медицинская сестра процедурного кабинета",
        "медицинская сестра стоматологического отделения",
        "медицинская сестра по физиотерапии",
        "медицинская сестра по массажу",
        "медицинский регистратор",
        "помощник врача","помощник врача по гигиене",
        "кондуктор","кассир",
        "оператор пк","оператор 1с",
        "диспетчер","товаровед","документовед",
        "оператор видеонаблюдения",
        "социальный работник","сиделка",
        "экскурсовод","кладовщик"
    },

    ["Рабочие промышленности, строительства, транспорта"] = new List<string>
    {
        "слесарь","слесарь-ремонтник","слесарь-сантехник",
        "слесарь кипиа","слесарь по ремонту",
        "слесарь по ремонту и обслуживанию",
        "вентиляции","кондиционирования",
        "электромонтер","электромонтер опс",
        "электромонтер охранно-пожарной сигнализации",
        "электромонтер по ремонту и обслуживанию электрооборудования",
        "электрик","электромонтажник","электромеханик",
        "техник","технолог",
        "повар","пекарь",
        "рабочий","подсобный рабочий","разнорабочий",
        "водитель","водитель автомобиля","водитель пожарного автомобиля",
        "грузчик","кочегар","приемщик",
        "сварщик","электрогазосварщик","электросварщик ручной сварки",
        "газорезчик","резчик горячего металла",
        "токарь","фрезеровщик","сверловщик",
        "шлифовщик","полировщик",
        "монтажник","каменщик","штукатур","плотник",
        "тракторист","сборщик","укладчик",
        "стропальщик","формовщик","формовщик машинной формовки",
        "термист","термист проката и труб",
        "нагревальщик металла",
        "разливщик стали","подручный сталевара",
        "вальцовщик","вальцовщик стана",
        "огнеупорщик",
        "монтер пути","составитель поездов",
        "бурильщик",
        "станочник","станочник деревообрабатывающих станков",
        "контролер","контролер производства",
        "контролер металлов","контролер газового хозяйства",
        "сортировщик","сортировщик-сдатчик металла",
        "дезинфектор",
        "правильщик","правильщик проката",
        "обработчик","обработчик металла",
        "посадчик металла"
    },

    ["Операторы, аппаратчики, машинисты"] = new List<string>
    {
        "оператор","оператор пульта управления",
        "оператор поста управления",
        "оператор кассир","оператор-кассир",
        "оператор агзс","оператор агнкс",
        "машинист","машинист крана",
        "машинист металлургического крана",
        "аппаратчик",
        "наладчик","наладчик оборудования",
        "наладчик оборудования пищевого производства",
        "оператор станка","оператор установки"
    },

    ["Неквалифицированные рабочие"] = new List<string>
    {
        "охранник","сторож","вахтер",
        "дворник",
        "уборщик","уборщица",
        "уборщик производственных помещений",
        "уборщик служебных помещений",
        "санитар","санитарка",
        "упаковщик","укладчик-упаковщик",
        "гардеробщик",
        "мойщик","мойщик посуды"
    }
  };

  public Dictionary<string, List<string>> GetProfessionalCategories()
  {
    return this.professionalCategories;
  }

  public string GetProfessionalGroupByJobName(string jobName)
  {
    foreach (var g in this.professionalCategories)
    {
      foreach (var c in g.Value)
      {
        if (c == jobName.ToLower())
        {
          return g.Key;
        }
      }
    }

    foreach (var g in this.professionalCategories)
    {
      foreach (var c in g.Value)
      {
        if (jobName.ToLower().Contains(c))
        {
          return g.Key;
        }
      }
    }

    return null;
  }
}