namespace VacanciesParser;

public class ProfessionalCategory
{
  private Dictionary<string, List<string>> ProfessionalCategories = new Dictionary<string, List<string>>()
  {
    ["Руководители"] = new List<string>
    {
        "руководитель",
        "начальник",
        "заведующий",
        "ведущий",
        "директор",
        "заместитель",
        "глава",
        "старший",
        "мастер цеха",
        "начальник отдела"
    },

    ["Специалисты высшего уровня"] = new List<string>
    {
        "врач",
        "ветеринар",
        "инженер",
        "программист",
        "системный администратор",
        "юрисконсульт",
        "специалист",
        "инспектор",
        "лесничий",
        "муниципальный служащий",
        "юрис",
        "фармацевт",
        "оценщик",
        "энергетик",
        "проектировщик",
        "конструктор",
        "электроник",
        "бухгалтер",
        "экономист",
        "эколог",
        "психолог",
        "тьютор",
        "учитель",
        "преподаватель",
        "эксперт"
    },

    ["Специалисты среднего уровня"] = new List<string>
    {
        "администратор",
        "продавец",
        "консультант",
        "педагог",
        "преподаватель",
        "воспитатель",
        "помощник воспитателя",
        "младший воспитатель",
        "инструктор",
        "тренер",
        "массажист",
        "медицинская сестра",
        "медицинский брат",
        "медицинский регистратор",
        "кондуктор",
        "токарь",
        "воспитат",
        "кондитер",
        "гример",
        "стрелок",
        "экскурсовод",
        "экспозицион",
        "кассир",
        "портье",
        "диспетчер",
        "товаровед",
        "оператор видеонаблюдения",
        "документовед",
        "социальный работник",
        "бухгалтер 1",
        "бухгалтер 2"
    },

    ["Рабочие промышленности, строительства, транспорта"] = new List<string>
    {
        "слесарь",
        "электромонтер",
        "электромеханик",
        "электрик",
        "электромонтажник",
        "техник",
        "технолог",
        "повар",
        "пекарь",
        "рабочий",
        "подсобный",
        "разнорабочий",
        "работник",
        "мастер",
        "водитель",
        "грузчик",
        "кочегар",
        "приемщик",
        "паяльщик",
        "промывщик",
        "бурильщик",
        "правильщик",
        "полировщик",
        "сварщик",
        "электрогазосварщик",
        "фрезеровщик",
        "сверловщик",
        "монтажник",
        "маркировщик",
        "мойщик",
        "тракторист",
        "сборщик",
        "укладчик",
        "плотник",
        "термист",
        "срезчик",
        "швейного",
        "скважин"
    },

    ["Операторы, аппаратчики, машинисты"] = new List<string>
    {
        "оператор",
        "машинист",
        "аппаратчик",
        "наладчик",
        "котельной",
        "машинного доения",
        "станка",
        "установки"
    },

    ["Неквалифицированные рабочие"] = new List<string>
    {
        "охранник",
        "сторож",
        "вахтер",
        "дворник",
        "уборщик",
        "уборщица",
        "санитар",
        "санитарка",
        "упаковщик",
        "укладчик-упаковщик",
        "гардеробщик"
    }
  };

  public Dictionary<string, List<string>> GetProfessionalCategories()
  {
      return this.ProfessionalCategories;
  }
}