namespace VacanciesParser;

public class ProfessionalCategory
{
  private Dictionary<string, List<string>> professionalCategories = new Dictionary<string, List<string>>()
  {
    ["Руководители"] = new List<string>
    {
        "руководитель","начальник","заведующий","директор","генеральный директор",
        "исполнительный директор","заместитель","зам директора","глава","старший",
        "главный","бригадир","руководитель группы","тимлид","менеджер",
        "старший менеджер","ведущий менеджер","управляющий","администратор (старший)",
        "начальник отдела","начальник управления","начальник участка",
        "начальник производства","заведующий складом"
    },

    ["Специалисты высшего уровня"] = new List<string>
    {
        "врач","врач-невролог","врач-онколог","врач-педиатр","врач-терапевт",
        "врач-терапевт участковый","врач-стоматолог","врач-стоматолог-терапевт",
        "ветеринар","инженер","инженер-технолог","инженер-проектировщик",
        "инженер-конструктор","программист","разработчик","системный администратор",
        "администратор баз данных","devops","юрисконсульт","юрист",
        "специалист","ведущий специалист","главный специалист",
        "инспектор","государственный инспектор","главный государственный инспектор",
        "лесничий","муниципальный служащий","фармацевт","фармацевт-провизор",
        "оценщик","энергетик","электроник","бухгалтер","экономист",
        "ведущий экономист","экономист по труду","эколог","психолог",
        "тьютор","учитель","преподаватель","эксперт","аналитик",
        "бизнес-аналитик","системный аналитик","методист",
        "специалист по кадрам","специалист по персоналу",
        "специалист по охране труда","специалист по развитию",
        "специалист по административно-хозяйственному обеспечению",
        "специалист поддержки","специалист поддержки 1с",
        "клиентский менеджер","старший клиентский менеджер"
    },

    ["Специалисты среднего уровня"] = new List<string>
    {
        "администратор","продавец","продавец-кассир","консультант",
        "педагог","воспитатель","помощник воспитателя","младший воспитатель",
        "инструктор","инструктор по труду","тренер","методист",
        "массажист","медицинская сестра","медицинский брат",
        "медицинская сестра процедурного кабинета",
        "медицинская сестра по физиотерапии",
        "медицинская сестра по массажу",
        "медицинский регистратор","помощник врача",
        "кондуктор","кассир","оператор пк","оператор 1с",
        "диспетчер","товаровед","документовед",
        "оператор видеонаблюдения","социальный работник",
        "культорганизатор","экскурсовод","кладовщик",
        "сиделка","менеджер по работе с клиентами",
        "старший менеджер по работе с клиентами"
    },

    ["Рабочие промышленности, строительства, транспорта"] = new List<string>
    {
        "слесарь","слесарь-ремонтник","слесарь-сантехник",
        "слесарь кипиа","слесарь по ремонту",
        "электромонтер","электромонтер опс",
        "электромонтер по ремонту","электрик",
        "электромонтажник","электромеханик",
        "техник","технолог","повар","пекарь",
        "рабочий","подсобный рабочий","разнорабочий",
        "водитель","водитель автомобиля","водитель пожарного автомобиля",
        "грузчик","кочегар","приемщик",
        "сварщик","электрогазосварщик","электросварщик",
        "газорезчик","токарь","фрезеровщик","сверловщик",
        "шлифовщик","полировщик","монтажник",
        "каменщик","штукатур","плотник",
        "тракторист","сборщик","укладчик",
        "стропальщик","формовщик","термист",
        "резчик","нагревальщик металла",
        "разливщик стали","вальцовщик","огнеупорщик",
        "монтер пути","бурильщик",
        "станочник","станочник деревообрабатывающих станков",
        "контролер","контролер производства",
        "сортировщик","кладовщик","дезинфектор"
    },

    ["Операторы, аппаратчики, машинисты"] = new List<string>
    {
        "оператор","оператор пульта управления",
        "оператор поста управления",
        "оператор кассир","оператор-кассир",
        "оператор агзс","оператор агнкс",
        "машинист","машинист крана",
        "машинист металлургического крана",
        "аппаратчик","наладчик",
        "наладчик оборудования",
        "оператор станка","оператор установки"
    },

    ["Неквалифицированные рабочие"] = new List<string>
    {
        "охранник","сторож","вахтер",
        "дворник","уборщик","уборщица",
        "уборщик производственных помещений",
        "санитар","санитарка",
        "упаковщик","укладчик-упаковщик",
        "гардеробщик","мойщик","мойщик посуды"
    }
  };

  public Dictionary<string, List<string>> GetProfessionalCategories()
  {
    return this.professionalCategories;
  }

  public string GetProfessionalGroupByJobName(string jobName)
  {
    foreach (var g in this.professionalCategories)
    {
      foreach (var c in g.Value)
      {
        if (c == jobName.ToLower())
        {
          return g.Key;
        }
      }
    }

    foreach (var g in this.professionalCategories)
    {
      foreach (var c in g.Value)
      {
        if (jobName.ToLower().Contains(c))
        {
          return g.Key;
        }
      }
    }

    return null;
  }
}